PecaJosef/PCK-ST1/STM32 Firmware/PCK-ST1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define AZ_EN_Pin GPIO_PIN_5
#define AZ_EN_GPIO_Port GPIOA
#define AZ_DIR_Pin GPIO_PIN_6
#define AZ_DIR_GPIO_Port GPIOA
#define AZ_STEP_Pin GPIO_PIN_7
#define AZ_STEP_GPIO_Port GPIOA
#define STEP_SLEEP_n_Pin GPIO_PIN_0
#define STEP_SLEEP_n_GPIO_Port GPIOB
#define EL_EN_Pin GPIO_PIN_1
#define EL_EN_GPIO_Port GPIOB
#define EL_DIR_Pin GPIO_PIN_2
#define EL_DIR_GPIO_Port GPIOB
#define EL_STEP_Pin GPIO_PIN_10
#define EL_STEP_GPIO_Port GPIOB
#define DEC_EN_Pin GPIO_PIN_6
#define DEC_EN_GPIO_Port GPIOC
#define DEC_DIR_Pin GPIO_PIN_7
#define DEC_DIR_GPIO_Port GPIOC
#define DEC_STEP_Pin GPIO_PIN_8
#define DEC_STEP_GPIO_Port GPIOC
#define LED4_Pin GPIO_PIN_14
#define LED4_GPIO_Port GPIOA
#define LED3_Pin GPIO_PIN_15
#define LED3_GPIO_Port GPIOA
#define LED2_Pin GPIO_PIN_10
#define LED2_GPIO_Port GPIOC
#define LED1_Pin GPIO_PIN_11
#define LED1_GPIO_Port GPIOC
#define PWR_STATE_Pin GPIO_PIN_3
#define PWR_STATE_GPIO_Port GPIOB
#define LED_USB_Pin GPIO_PIN_4
#define LED_USB_GPIO_Port GPIOB
#define LED_DC_Pin GPIO_PIN_5
#define LED_DC_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
